package Before.TheRoadToJavaDeveloper.Lesson10;

public class Task3 {
    /**
     * Используя задачу https://github.com/KFalcon2022/practical-tasks/blob/master/src/lesson7_varargs_overloading/Task5.java
     * (можете сделать на основе своего решения,
     * но для наглядности удобства новых возможностей рекомендую взять за основу решение по ссылке):
     *     * 1.    Вынесите поиск простых чисел в отдельный класс.
     *     * 2.    Реализуйте возможность вывода на экран суммы N первых простых чисел,
     *     где N – число, введенное пользователем с клавиатуры;
     *     * 3.    Вынесите нужные вам переменные в поля класса.
     *     Если необходимо – сделайте их константами уровня класса или объекта.
     *     Помните, константа ссылочного типа гарантирует неизменность ссылки, а не содержимого объекта. Массив – ссылочный тип.
     *     * Примечание: это одна задача, а не различные варианты:)
     */
}
